load-testing/cart/v2/scripts/endpoint/post-save-items.yml
config:
  target: "http://localhost:8080/api/v2/cart"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: Ramp up
    - duration: 60
      arrivalRate: 100
      name: Sustained load
    - duration: 15
      arrivalRate: 100
      rampTo: 200
      name: Spike to max
    - duration: 30
      arrivalRate: 200
      name: Hold max
    - duration: 15
      arrivalRate: 200
      rampTo: 0
      name: Cooldown
scenarios:
  - name: "[POST] save items | add 4 items per customer"
    flow:
      - post:
          url: "/items/save"
          json:
            customerId: "{{$uuid}}"
            productId: "168a1448-bd14-4ee2-98ed-ffd2b619830c"
            cant: 1
            price: 100    
          capture:
            - json: "$.items[0].cartItemId"
              as: "cartItemId_zero"            
      - post:
          url: "/items/save"
          json:
            customerId: "{{$uuid}}"
            productId: "0ae5605e-3797-4bb6-a0f7-e7c3f23f367b"
            cant: 2
            price: 100
          capture:
            - json: "$.items[1].cartItemId"
              as: "cartItemId_one"             
      - post:
          url: "/items/save"
          json:
            customerId: "{{$uuid}}"
            productId: "bae1ec99-4cb9-4210-a775-e994f1435175"
            cant: 1
            price: 120
          capture:
            - json: "$.items[2].cartItemId"
              as: "cartItemId_two"             
      - post:
          url: "/items/save"
          json:
            customerId: "{{$uuid}}"
            productId: "fd386d00-c33e-43bf-9fe9-5779cdebc7cb"
            cant: 2
            price: 100
          capture:
            - json: "$.items[3].cartItemId"
              as: "cartItemId_three"              
      - post:
          url: "/items/save"
          json:
            customerId: "{{$uuid}}"
            productId: "1b10cc0a-0606-4d1d-8d8d-4658fe7ea3ed"
            cant: 3
            price: 500            
          capture:
            - json: "$.items[4].cartItemId"
              as: "cartItemId_four"              
      - put:
          url: "/item/quantity/increment"
          json:
            customerId: "{{$uuid}}"
            cartItemId: "{{cartItemId_zero}}"
      - put:
          url: "/item/quantity/increment"
          json:
            customerId: "{{$uuid}}"
            cartItemId: "{{cartItemId_zero}}"                                 
      - put:
          url: "/item/quantity/decrement"
          json:
            customerId: "{{$uuid}}"
            cartItemId: "{{cartItemId_zero}}"             
      - delete:
          url: "/items/delete"
          json:
            customerId: "{{$uuid}}"
            cartItemId: "{{cartItemId_zero}}"